.. _ssn_userguide:

SSN Strings
============

Introduction
------------

The function :func:`clean_ch_ssn() <dataprep.clean.clean_ch_ssn.clean_ch_ssn>` cleans a column containing Swiss social security number (SSN) strings, and standardizes them in a given format. The function :func:`validate_ch_ssn() <dataprep.clean.clean_ch_ssn.validate_ch_ssn>` validates either a single SSN strings, a column of SSN strings or a DataFrame of SSN strings, returning `True` if the value is valid, and `False` otherwise.

SSN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "7569217076985"
* `standard`: SSN strings with proper whitespace in the proper places, like "756.9217.0769.85"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_ch_ssn()` and `validate_ch_ssn()`.

### An example dataset containing SSN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "ssn": [
            "7569217076985",
            "756.9217.0769.84",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                ssn                                           address
0     7569217076985                                     123 Pine Ave.
1  756.9217.0769.84                                           main st
2       51824753556                      1234 west main heights 57033
3    51 824 753 556                    apt 1 789 s maple rd manhattan
4             hello                robie house, 789 north main street
5               NaN  (staples center) 1111 S Figueroa St, Los Angeles
6              NULL                                             hello

## 1. Default `clean_ch_ssn`

By default, `clean_ch_ssn` will clean ssn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_ch_ssn
clean_ch_ssn(df, column = "ssn")

,ssn,address,ssn_clean
0,7569217076985,123 Pine Ave.,756.9217.0769.85
1,756.9217.0769.84,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_ch_ssn(df, column = "ssn", output_format="standard")

,ssn,address,ssn_clean
0,7569217076985,123 Pine Ave.,756.9217.0769.85
1,756.9217.0769.84,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_ch_ssn(df, column = "ssn", output_format="compact")

,ssn,address,ssn_clean
0,7569217076985,123 Pine Ave.,7569217076985
1,756.9217.0769.84,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned SSN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_ch_ssn(df, column="ssn", inplace=True)

          ssn_clean                                           address
0  756.9217.0769.85                                     123 Pine Ave.
1               NaN                                           main st
2               NaN                      1234 west main heights 57033
3               NaN                    apt 1 789 s maple rd manhattan
4               NaN                robie house, 789 north main street
5               NaN  (staples center) 1111 S Figueroa St, Los Angeles
6               NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_ch_ssn(df, "ssn", errors="coerce")

,ssn,address,ssn_clean
0,7569217076985,123 Pine Ave.,756.9217.0769.85
1,756.9217.0769.84,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_ch_ssn(df, "ssn", errors="ignore")

,ssn,address,ssn_clean
0,7569217076985,123 Pine Ave.,756.9217.0769.85
1,756.9217.0769.84,main st,756.9217.0769.84
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_ch_ssn()`

`validate_ch_ssn()` returns `True` when the input is a valid SSN. Otherwise it returns `False`.

The input of `validate_ch_ssn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_ch_ssn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_ch_ssn()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_ch_ssn
print(validate_ch_ssn("7569217076985"))
print(validate_ch_ssn("756.9217.0769.84"))
print(validate_ch_ssn("51824753556"))
print(validate_ch_ssn("51 824 753 556"))
print(validate_ch_ssn("hello"))
print(validate_ch_ssn(np.nan))
print(validate_ch_ssn("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_ch_ssn(df["ssn"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: ssn, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_ch_ssn(df, column="ssn")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: ssn, dtype: bool

### Only DataFrame

In [11]:
validate_ch_ssn(df)

     ssn  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False